-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/bq/bquarant/med/GPA Calculations.log
  log type:  text
 opened on:  26 Mar 2012, 00:26:09

. di SUNY BUFFALO
SUNY not found
r(111);

. di as text SUNY BUFFALO
SUNY not found
r(111);

. display "SUNY BUFFALO"
SUNY BUFFALO

. ttesti 8 3.503 0.349 136 3.7 0.35

Two-sample t test with equal variances
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       x |       8       3.503    .1233901        .349    3.211229    3.794771
       y |     136         3.7    .0300123         .35    3.640645    3.759355
---------+--------------------------------------------------------------------
combined |     144    3.689056    .0293044    .3516527     3.63113    3.746981
---------+--------------------------------------------------------------------
    diff |               -.197    .1273133               -.4486743    .0546743
------------------------------------------------------------------------------
    diff = mean(x) - mean(y)                                      t =  -1.5474
Ho: diff = 0                                     degrees of freedom =      142

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0620         Pr(|T| > |t|) = 0.1240          Pr(T > t) = 0.9380

. ttesti 8 3.463 0.310 136 3.6 0.310

Two-sample t test with equal variances
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       x |       8       3.463    .1096016         .31    3.203834    3.722166
       y |     136         3.6    .0265823         .31    3.547428    3.652572
---------+--------------------------------------------------------------------
combined |     144    3.592389    .0258763    .3105151    3.541239    3.643538
---------+--------------------------------------------------------------------
    diff |               -.137    .1127791               -.3599429    .0859429
------------------------------------------------------------------------------
    diff = mean(x) - mean(y)                                      t =  -1.2148
Ho: diff = 0                                     degrees of freedom =      142

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1132         Pr(|T| > |t|) = 0.2265          Pr(T > t) = 0.8868

. ttesti 8 3.463 0.310 136 3.6 0.310, unequal

Two-sample t test with unequal variances
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       x |       8       3.463    .1096016         .31    3.203834    3.722166
       y |     136         3.6    .0265823         .31    3.547428    3.652572
---------+--------------------------------------------------------------------
combined |     144    3.592389    .0258763    .3105151    3.541239    3.643538
---------+--------------------------------------------------------------------
    diff |               -.137    .1127791               -.3979582    .1239582
------------------------------------------------------------------------------
    diff = mean(x) - mean(y)                                      t =  -1.2148
Ho: diff = 0                     Satterthwaite's degrees of freedom =  7.84634

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1299         Pr(|T| > |t|) = 0.2597          Pr(T > t) = 0.8701

. ttesti 8 3.463 0.310 136 3.6 0.310

Two-sample t test with equal variances
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       x |       8       3.463    .1096016         .31    3.203834    3.722166
       y |     136         3.6    .0265823         .31    3.547428    3.652572
---------+--------------------------------------------------------------------
combined |     144    3.592389    .0258763    .3105151    3.541239    3.643538
---------+--------------------------------------------------------------------
    diff |               -.137    .1127791               -.3599429    .0859429
------------------------------------------------------------------------------
    diff = mean(x) - mean(y)                                      t =  -1.2148
Ho: diff = 0                                     degrees of freedom =      142

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1132         Pr(|T| > |t|) = 0.2265          Pr(T > t) = 0.8868

. ttesti 8 3.50 0.35 136 3.8 0.35

Two-sample t test with equal variances
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       x |       8         3.5    .1237437         .35    3.207393    3.792607
       y |     136         3.8    .0300123         .35    3.740645    3.859355
---------+--------------------------------------------------------------------
combined |     144    3.783333    .0296272    .3555258     3.72477    3.841897
---------+--------------------------------------------------------------------
    diff |                 -.3    .1273312               -.5517097   -.0482903
------------------------------------------------------------------------------
    diff = mean(x) - mean(y)                                      t =  -2.3561
Ho: diff = 0                                     degrees of freedom =      142

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0099         Pr(|T| > |t|) = 0.0198          Pr(T > t) = 0.9901

. display "ALBERT EINSTEIN"
ALBERT EINSTEIN

. ttesti 8 3.50 0.35 136 3.8 0.35

Two-sample t test with equal variances
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       x |       8         3.5    .1237437         .35    3.207393    3.792607
       y |     136         3.8    .0300123         .35    3.740645    3.859355
---------+--------------------------------------------------------------------
combined |     144    3.783333    .0296272    .3555258     3.72477    3.841897
---------+--------------------------------------------------------------------
    diff |                 -.3    .1273312               -.5517097   -.0482903
------------------------------------------------------------------------------
    diff = mean(x) - mean(y)                                      t =  -2.3561
Ho: diff = 0                                     degrees of freedom =      142

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0099         Pr(|T| > |t|) = 0.0198          Pr(T > t) = 0.9901

. ttesti 8 3.46 0.31 136 3.8 0.31

Two-sample t test with equal variances
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       x |       8        3.46    .1096016         .31    3.200834    3.719166
       y |     136         3.8    .0265823         .31    3.747428    3.852572
---------+--------------------------------------------------------------------
combined |     144    3.781111    .0265539    .3186469    3.728622      3.8336
---------+--------------------------------------------------------------------
    diff |                -.34    .1127791               -.5629429   -.1170571
------------------------------------------------------------------------------
    diff = mean(x) - mean(y)                                      t =  -3.0147
Ho: diff = 0                                     degrees of freedom =      142

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0015         Pr(|T| > |t|) = 0.0030          Pr(T > t) = 0.9985

. display "STONY BROOK"
STONY BROOK

. ttesti 8 3.46 0.31 124 3.7 0.31

Two-sample t test with equal variances
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       x |       8        3.46    .1096016         .31    3.200834    3.719166
       y |     124         3.7    .0278388         .31    3.644895    3.755105
---------+--------------------------------------------------------------------
combined |     132    3.685455    .0273406    .3141191    3.631368    3.739541
---------+--------------------------------------------------------------------
    diff |                -.24    .1130818               -.4637189   -.0162811
------------------------------------------------------------------------------
    diff = mean(x) - mean(y)                                      t =  -2.1224
Ho: diff = 0                                     degrees of freedom =      130

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0179         Pr(|T| > |t|) = 0.0357          Pr(T > t) = 0.9821

. ttesti 8 3.50 0.35 124 3.7 0.35

Two-sample t test with equal variances
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       x |       8         3.5    .1237437         .35    3.207393    3.792607
       y |     124         3.7    .0314309         .35    3.637784    3.762216
---------+--------------------------------------------------------------------
combined |     132    3.687879    .0306322    .3519369    3.627281    3.748477
---------+--------------------------------------------------------------------
    diff |                 -.2     .127673               -.4525858    .0525858
------------------------------------------------------------------------------
    diff = mean(x) - mean(y)                                      t =  -1.5665
Ho: diff = 0                                     degrees of freedom =      130

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0598         Pr(|T| > |t|) = 0.1197          Pr(T > t) = 0.9402

. display "DOWNSTATE"
DOWNSTATE

. ttesti 8 3.50 0.35 183 3.7 0.35

Two-sample t test with equal variances
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       x |       8         3.5    .1237437         .35    3.207393    3.792607
       y |     183         3.7    .0258727         .35    3.648951    3.751049
---------+--------------------------------------------------------------------
combined |     191    3.691623    .0254251    .3513815    3.641471    3.741775
---------+--------------------------------------------------------------------
    diff |                 -.2    .1264195               -.4493746    .0493746
------------------------------------------------------------------------------
    diff = mean(x) - mean(y)                                      t =  -1.5820
Ho: diff = 0                                     degrees of freedom =      189

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0577         Pr(|T| > |t|) = 0.1153          Pr(T > t) = 0.9423

. ttesti 8 3.46 0.31 183 3.7 0.31

Two-sample t test with equal variances
------------------------------------------------------------------------------
         |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       x |       8        3.46    .1096016         .31    3.200834    3.719166
       y |     183         3.7    .0229159         .31    3.654785    3.745215
---------+--------------------------------------------------------------------
combined |     191    3.689948     .022642    .3129183    3.645286     3.73461
---------+--------------------------------------------------------------------
    diff |                -.24    .1119716               -.4608746   -.0191254
------------------------------------------------------------------------------
    diff = mean(x) - mean(y)                                      t =  -2.1434
Ho: diff = 0                                     degrees of freedom =      189

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0167         Pr(|T| > |t|) = 0.0334          Pr(T > t) = 0.9833

